{"education_and_training":[{"EDUCATION":"\n\nBachelor of Commerce in W.B.C.H.S.E CALCUTTA UNIVERSITY - Kolkata, West Bengal 2009\n\nindustrial Accountant Institute of Computer Accounts 2004\n\nADDITIONAL INFORMATION\n\n"}],"skills":[{"Key Skills":"\n\n• Invoices\/Expense Reports\/Payment Transactions. • Tax Auditing & Analyzing Books of Account. • Maintaining Books of Account in Computerized System & Manually system. • Ledger & Cash Book Scrutiny Calculating Sales Tax Liability.\n\n• Preparing Income Statement, (Profit & Loss A\/C) Balance Sheet & Trial Balance. • Journal Entries, Ledger Posting & BRS. • Stock Summary & Stock Valuation. • Handling Properly Petty Cash.\n"}],"basics":{"gender":"male","name":{"firstName":"Alok","surname":"Accounts","middleName":"Singh"},"title":"Executive"},"work_experience":[{"WORK EXPERIENCE":"\n\nAccounts Executive BOBBY GARMENTS - Kolkata, West Bengal - July 2012 to Present\n\nPromoted to Executive accounts payable for BOBBY GARMENTS preparing and analyzing accountings records and Financial statements reports. Facilitated \"no-fault\" internal and external audits as a result of sound recordkeeping and thorough documentation. Composed effective accounting and handling Petty Cash for Office Expenses.\n\nBOBBY GARMENTS (Manufacturing Company. ) Key Results: • Passing Journal entries, Ledger posting, recording Expenses & payment transactions in Cash Book and Bank Book in effective accounting standard. • Recording the payment transactions in accurate and proper way within the Time Frame & prepare Income and financials statement (Profit & Loss A\/C), Balance Sheet. • Valuation of company assets and liabilities. • A quick learner with the ability to works in as a team, flexible and organizes things with optimistic way for the betterment of the organization. • Consistently maintained accuracy in calculating figures and amounts such as discounts, interest, commissions, proportions and percentages.\n\nChartered Accountant AGARWAL ANIL KUMAR & CO - Dalhousie, Himachal Pradesh - April 2011 to May 2012\n\nFor employers, handled daily Audit programming and planning of activities to ensure completion of tax audits within the time frame. Analyzing books of Accounts, proper & accurate checking of invoices, Purchase Challans, Sales Challans, expense reports, credit memos and payment transactions and Opening Ledger Balances Verification & cross verification of Ledger posting & prepare Income and financials statement (Profit & Loss A\/C), Balance Sheet and Valuation of Closing Stock on FIFO Basis.\n\nKey Results: • Conducting the accurate and proper auditing of Books of Account within the Time Frame & prepare Income and financials statement (Profit & Loss A\/C), Balance Sheet. • Prepare BRS, VAT & CST Summary, Relative Payment, and Summary of Capital account, TDS Chart, Expenses Details (Salary, Rent & Telephone Bills) & Stock Summary. • Verifying Opening Ledger Balances, VAT Returns, CST Returns, Unsecured Loan Account, Fixed Assets TDS Returns. • Cross checking Of Ledger Posting and Cash Book Scrutiny • Accurate checking of invoices, Purchase Challans, Sales Challans, expense reports, credit memos and payment transactions & Stock Valuation on FIFO basis • Consistently maintained accuracy in calculating figures and amounts such as discounts, interest, commissions, proportions and percentages\n\n"}]}